# Prerequisite
# * Install Command line tools for Xcode
# xcode-select --install
# * Install brew
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# * Install brew bundle
# brew tap Homebrew/bundle

brew "boost"
brew "gcc"
brew "pipenv"
brew "tmux"

tap "homebrew/cask"
cask_args appdir: "/Applications"
cask "authy"
cask "box-sync"
cask "cheatsheet"
cask "clipy"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "skype-for-business"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"

brew "mas"
mas "be-focused-pro-focus-timer", id:961632517
mas "compare-merge", id:478570084
mas "popclip", id:445189367
mas "ulysses", id:1225570693
mas "yoink", id:457622435
